package ru.geekbrains.lessons.les13.homeWork;
/*
Все участники должны стартовать одновременно, несмотря на разное время подготовки. В тоннель не
может одновременно заехать больше половины участников (условность).
Попробуйте все это синхронизировать.
Первый участник, пересекший финишную черту, объявляется победителем (в момент пересечения
этой самой черты). Победитель должен быть только один (ситуация с 0 или 2+ победителями
недопустима).
Когда все завершат гонку, нужно выдать объявление об окончании.
Можно корректировать классы (в том числе конструктор машин) и добавлять объекты классов из
пакета java.util.concurrent.
 */
public class MainClass {

    public static void main(String[] args) {
        Race race = new Race(4,
                new Road(60),
                new Tunnel(80, 4),
                new Road(40),
                new Tunnel(30, 2),
                new Road(100),
                new Road(20));

        race.makeRace();
    }
}
